// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>
#include <math.h>
#define _USE_MATH_DEFINES

using namespace std;
int main()
{
   setlocale(LC_ALL, "rus");
   double sqrside;
   cout << "сторона квадрата:";
   cin >> sqrside;
   double r = sqrside / 2;
   cout << "радиус круга =" << r << endl;
   double Sc = 3.14 * pow(r, 2);
   cout << "площадь круга =" << Sc<<endl;
   double Ss = pow(sqrside, 2);
   cout << "площадь квадрата =" << Ss << endl;


}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
